{
    "version": "https://jsonfeed.org/version/1",
    "title": "GlobeWatch",
    "description": "",
    "home_page_url": "https://globe-watch.netlify.app",
    "feed_url": "https://globe-watch.netlify.app/feed.json",
    "user_comment": "",
    "icon": "https://globe-watch.netlify.app/media/website/ChatGPT-Image-Jun-28-2025-07_50_46-PM.png",
    "author": {
        "name": "Anurag Srivastav"
    },
    "items": [
        {
            "id": "https://globe-watch.netlify.app/diplomatic-decorum-shattered-the-ashgabat-wait-and-the-gatecrash.html",
            "url": "https://globe-watch.netlify.app/diplomatic-decorum-shattered-the-ashgabat-wait-and-the-gatecrash.html",
            "title": "Diplomatic Decorum Shattered: The Ashgabat Wait and the &#x27;Gatecrash&#x27;",
            "summary": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jcb2sv7o9g\">The 40-Minute Wait</a></li>\n<li><a href=\"#mcetoc_1jcb2sv7o9h\">The Unscripted Entry</a></li>\n<li><a href=\"#mcetoc_1jcb2sv7o9i\">Context and Contrasts</a>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li><a href=\"#mcetoc_1jcb335iu9s\">Recent Putin-Modi Bonhomie:   </a></li>\n<li><a href=\"#mcetoc_1jcb335iu9t\">Previous Embarrassments:</a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1jcb2sv7o9k\">Retraction and Official Communication</a></li>\n</ul>\n</div>\n<p data-path-to-node=\"1\">Pakistani Prime Minister Shehbaz Sharif reportedly faced a diplomatic embarrassment in Ashgabat, Turkmenistan, after allegedly being left waiting by Russian President Vladimir Putin.</p>\n<p data-path-to-node=\"2\">The incident, which occurred at the International Forum on Peace and Trust, culminated in what was widely described as Sharif's unscripted <strong>\"gatecrash\"</strong> of a closed-door meeting between Putin and Turkey's President Erdoğan.</p>\n<p data-path-to-node=\"3\">The public perception of the event highlighted Russia's contrastingly warm ties with India, fueling claims of a significant diplomatic snub to Pakistan.</p>\n",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jcb2sv7o9g\">The 40-Minute Wait</a></li>\n<li><a href=\"#mcetoc_1jcb2sv7o9h\">The Unscripted Entry</a></li>\n<li><a href=\"#mcetoc_1jcb2sv7o9i\">Context and Contrasts</a>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li><a href=\"#mcetoc_1jcb335iu9s\">Recent Putin-Modi Bonhomie:   </a></li>\n<li><a href=\"#mcetoc_1jcb335iu9t\">Previous Embarrassments:</a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1jcb2sv7o9k\">Retraction and Official Communication</a></li>\n</ul>\n</div>\n<p data-path-to-node=\"1\">Pakistani Prime Minister Shehbaz Sharif reportedly faced a diplomatic embarrassment in Ashgabat, Turkmenistan, after allegedly being left waiting by Russian President Vladimir Putin.</p>\n<p data-path-to-node=\"2\">The incident, which occurred at the International Forum on Peace and Trust, culminated in what was widely described as Sharif's unscripted <strong>\"gatecrash\"</strong> of a closed-door meeting between Putin and Turkey's President Erdoğan.</p>\n<p data-path-to-node=\"3\">The public perception of the event highlighted Russia's contrastingly warm ties with India, fueling claims of a significant diplomatic snub to Pakistan.</p>\n\n<h3 id=\"mcetoc_1jcb2sv7o9g\" data-path-to-node=\"3\">The 40-Minute Wait</h3>\n<p data-path-to-node=\"4\"><span class=\"citation-21\">According to initial reports and viral video footage shared by Russian state media outlet </span><i><span class=\"citation-21\">RT India</span></i><span class=\"citation-21\"> (which later deleted the post with a clarification), Prime Minister Sharif and his delegation were scheduled for a meeting with President Putin but were allegedly kept waiting for over </span><strong><span class=\"citation-21\">40 minutes</span></strong><span class=\"citation-21 citation-end-21\"> in a separate hall.</span></p>\n<div class=\"source-inline-chip-container ng-star-inserted\"> </div>\n<p data-path-to-node=\"5\"><span class=\"citation-20 citation-end-20\">Video snippets from the time showed a visibly restless Sharif.</span> The prolonged wait, which is often interpreted in diplomatic circles as a calculated slight or a demonstration of priority, set the stage for the controversial sequence of events that followed.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://globe-watch.netlify.app/media/posts/8/Screenshot-2025-12-13-105430.png\" alt=\"WAIT OF PUTIN BY SHABAZ SHARIF\" width=\"1456\" height=\"825\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://globe-watch.netlify.app/media/posts/8/responsive/Screenshot-2025-12-13-105430-xs.png 640w ,https://globe-watch.netlify.app/media/posts/8/responsive/Screenshot-2025-12-13-105430-sm.png 768w ,https://globe-watch.netlify.app/media/posts/8/responsive/Screenshot-2025-12-13-105430-md.png 1024w ,https://globe-watch.netlify.app/media/posts/8/responsive/Screenshot-2025-12-13-105430-lg.png 1366w ,https://globe-watch.netlify.app/media/posts/8/responsive/Screenshot-2025-12-13-105430-xl.png 1600w ,https://globe-watch.netlify.app/media/posts/8/responsive/Screenshot-2025-12-13-105430-2xl.png 1920w\"><figcaption>CREDIT: RT INDIA</figcaption></figure>\n<h3 id=\"mcetoc_1jcb2sv7o9h\">The Unscripted Entry</h3>\n<p data-path-to-node=\"7\">Patience, it seems, eventually wore thin. <span class=\"citation-19 citation-end-19\">Reports indicate that Prime Minister Sharif, after the considerable delay, chose to enter an ongoing, closed-door bilateral meeting between President Putin and Turkish President Recep Tayyip Erdoğan.</span></p>\n<div class=\"source-inline-chip-container ng-star-inserted\"> </div>\n<p data-path-to-node=\"8\"><span class=\"citation-18 citation-end-18 interactive-span-hovered\">This unscripted entry—dubbed a \"gatecrash\" by many commentators—is considered a severe breach of diplomatic protocol.</span> <span class=\"citation-17\">While the exact conversation during his brief presence is unknown, Sharif reportedly stayed in the meeting for only about </span><strong><span class=\"citation-17\">ten minutes</span></strong><span class=\"citation-17 citation-end-17\"> before exiting.</span> <span class=\"citation-16 citation-end-16\">The optics of the unannounced intrusion, regardless of the cause, have been widely scrutinised as a desperate and undiplomatic manoeuvre.</span></p>\n<h3 id=\"mcetoc_1jcb2sv7o9i\" data-path-to-node=\"8\">Context and Contrasts</h3>\n<p data-path-to-node=\"8\">The diplomatic fallout of the Ashgabat incident is magnified by the current geopolitical environment:</p>\n<ul>\n<li>\n<h6 id=\"mcetoc_1jcb335iu9s\"><strong>Recent Putin-Modi Bonhomie:</strong>   </h6>\n</li>\n</ul>\n<p><span class=\"citation-15 citation-end-15\">The Ashgabat event came shortly after President Putin's high-profile and conspicuously warm visit to India, where he engaged in private dinners and animated conversations with Prime Minister Narendra Modi.</span> <span class=\"citation-14 citation-end-14\">This contrast has been highlighted by analysts, suggesting a significant difference in Moscow's diplomatic comfort levels and priorities with New Delhi versus Islamabad.</span></p>\n<ul>\n<li>\n<h6 id=\"mcetoc_1jcb335iu9t\">Previous Embarrassments:</h6>\n</li>\n</ul>\n<p><span class=\"citation-13 citation-end-13 interactive-span-hovered\">This is not the first time a Sharif-Putin meeting has drawn attention for an awkward moment.</span> <span class=\"citation-12 citation-end-12\">At an earlier Shanghai Cooperation Organisation (SCO) summit, Prime Minister Sharif struggled publicly with his translation headphones, an incident that also went viral and became a source of online ridicule.</span></p>\n\n<h3 id=\"mcetoc_1jcb2sv7o9k\">Retraction and Official Communication</h3>\n<p>Despite the viral narrative, the Russian state media outlet <i>RT India</i> <strong>deleted its post</strong>, admitting a \"misrepresentation of the events.\" The Russian embassy in Pakistan also released footage of a seemingly cordial handshake between Putin and Sharif. Nevertheless, the image of Sharif waiting and entering the closed meeting remains a powerful visual narrative, fueling claims of a deliberate diplomatic humiliation against Pakistan.</p>",
            "author": {
                "name": "XERO"
            },
            "tags": [
                   "RUSSIA",
                   "PAKISTAN"
            ],
            "date_published": "2025-12-13T10:58:08+05:30",
            "date_modified": "2025-12-13T11:15:31+05:30"
        },
        {
            "id": "https://globe-watch.netlify.app/priorities-in-parliament-vande-mataram-vs-the-air-we-breathe.html",
            "url": "https://globe-watch.netlify.app/priorities-in-parliament-vande-mataram-vs-the-air-we-breathe.html",
            "title": "Priorities in Parliament: Vande Mataram vs. The Air We Breathe",
            "summary": "It was a striking moment in our nation's legislative history: an entire day, stretching over 10 hours, dedicated to discussing the merits, history, and mandatory nature of singing the national song, Vande Mataram. While patriotism is a foundational pillar of any democracy, and celbrating our&hellip;",
            "content_html": "\n  <p>\n    <br>It was a striking moment in our nation's legislative history: an entire day, stretching over 10 hours, dedicated to discussing the merits, history, and mandatory nature of singing the national song, <code>Vande Mataram.</code><br><br><u>While patriotism is a foundational pillar of any democracy</u>, and celbrating our national symbols is undoubtedly important, one cannot help but pause and ask a critical question: At what cost are we pursuing symbolic displays of nationalism when tangible crises demand immediate action?<br><br><u><strong>The Allure of Patriotism: Why Vande Mataram Took Center Stage</strong></u><br>The sentiment behind the extensive debate—marking the 150th anniversary of the song—was the clear need to reinforce patriotism and national pride. For many, the national song is more than just a melody; it is a powerful invocation of India's freedom struggle and a tribute to the Motherland. The discussion allowed political parties to stake a claim on the legacy of the freedom movement, with debates focused on historical omissions, ideological differences, and the song's unifying power.<br><br>Ten hours were spent dissecting the nuances of tradition, constitutional mandates, and cultural reverence. This passionate and lengthy deliberation certainly served the purpose of highlighting the importance of the national song and showcasing the fervor of patriotism within the House.<br><br><u><strong>But the question remains: Was the timing right?<br></strong></u><br><strong><u>The Elephant in the Room: India's Deepening Pollution Crisis</u></strong>\n  </p>\n\n  <p>\n    <strong><br></strong>Meanwhile, as the heated discussion about a song played out within the hallowed halls of Parliament, millions of Indians outside were struggling with a far more immediate and existential threat: Air Pollution.<br><br>The air we breathe is no longer just air—it's a toxic cocktail. The facts are stark and terrifying, painting a picture of a public health emergency that cuts across all demographics.\n  </p>\n\n  <p>\n    <br><u><strong>Hazardous AQI Levels</strong></u>\n  </p>\n\n  <p>\n    While 'Good' air quality is an AQI of 0-50, many major Indian cities routinely report numbers that place them in the 'Poor', 'Very Poor', or even 'Severe' categories. For example, recent AQI readings in the National Capital Region (NCR) and surrounding areas have frequently hit levels like 250-400+, with cities like Delhi, Noida, Ghaziabad, and Lucknow struggling to breathe. Hapur, for instance, has recently recorded levels as high as 416 ('Severe').<br><br><strong>Health Crisis</strong>: Studies estimate that long-term exposure to contaminated air contributes to nearly 1.7 million deaths in India annually, with toxic PM2.5 particles penetrating deep into the lungs and bloodstream. Doctors have publicly declared the situation a full-blown health emergency, noting a surge in respiratory illnesses and related deaths.<br><br>National Problem: The issue is not restricted to the North. As many as 60% of India's districts breach the country's own National Ambient Air Quality Standard (NAAQS) for PM2.5, indicating a nationwide crisis.<br><br>The 10-hour parliamentary window, which could have been dedicated to finding coordinated, cross-party solutions to this life-threatening crisis, was instead spent on a symbolic debate.\n  </p>\n\n  <p>\n    <br><u><strong>The Public's Verdict: A Question of Wise Resource Utilisation</strong></u>\n  </p>\n\n  <p>\n    In the face of an invisible killer that stalks every street and every home, the public is rightly questioning the Parliament's priorities. The crisis is multifaceted, requiring legislative action on everything from industrial emissions and vehicular pollution to agricultural practices and construction dust. It demands a unified front from elected representatives, not a political blame game.<br><br>The public is now finding fault with both the ruling party and the opposition.<br><br>&gt;&gt;The ruling party is criticised for using the session to focus on a political-cultural issue to score points, diverting attention from its responsibility to deliver clean air.<br><br>&gt;&gt;The opposition is criticised for not aggressively forcing the conversation back to the pollution crisis, allowing a day of legislative time to be consumed by a less immediate issue.<br><br>Patriotism is essential, but a living, breathing citizen is more so. Patriotism is best demonstrated not just through the singing of a song, but through the dedicated, effective use of power and resources in the favour of the people of India. Using Parliament's valuable time to resolve a health emergency is, arguably, the highest form of national service.<br><br>We need our lawmakers to shift their focus from the symbolic to the substantial—from debating the meaning of the Motherland to preserving the health of her children.<br><br><strong>What are your thoughts?<br>Do you believe Parliament should have prioritised the pollution debate over the discussion on Vande Mataram?</strong>\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://globe-watch.netlify.app/media/posts/7/WhatsApp-Image-2025-12-12-at-18.37.51_de272784.jpg",
            "author": {
                "name": "XERO"
            },
            "tags": [
                   "POLLUTION",
                   "INDIA"
            ],
            "date_published": "2025-12-12T18:34:48+05:30",
            "date_modified": "2025-12-13T11:15:52+05:30"
        }
    ]
}
