{
    "version": "https://jsonfeed.org/version/1",
    "title": "GlobeWatch",
    "description": "",
    "home_page_url": "https://microo-watch.netlify.app",
    "feed_url": "https://microo-watch.netlify.app/feed.json",
    "user_comment": "",
    "icon": "https://microo-watch.netlify.app/media/website/ChatGPT-Image-Jun-28-2025-07_50_46-PM.png",
    "author": {
        "name": "Anurag Srivastav"
    },
    "items": [
        {
            "id": "https://microo-watch.netlify.app/hi-iresh.html",
            "url": "https://microo-watch.netlify.app/hi-iresh.html",
            "title": "Hi, Iresh.",
            "author": {
                "name": "Anurag Srivastav"
            },
            "tags": [
            ],
            "date_published": "2025-10-14T19:17:01+05:30",
            "date_modified": "2025-10-14T19:17:01+05:30"
        },
        {
            "id": "https://microo-watch.netlify.app/suicide-car-bombing-in-pakistans-khyber-pakhtunkhwa-kills-16-islamabad-blames-india-again-without-evidence.html",
            "url": "https://microo-watch.netlify.app/suicide-car-bombing-in-pakistans-khyber-pakhtunkhwa-kills-16-islamabad-blames-india-again-without-evidence.html",
            "title": "Suicide Car Bombing in Pakistan’s Khyber Pakhtunkhwa Kills 16 — Islamabad Blames India, Again Without Evidence",
            "summary": "A devastating suicide car bomb attack targeted a security convoy in Pakistan’s volatile Khyber Pakhtunkhwa province on Saturday,28/06/2025, leaving 16 people dead, including 13 security personnel, and injuring several others. According to officials, a vehicle packed with explosives rammed into a convoy near a military&hellip;",
            "content_html": "\n  <p>\n    A devastating suicide car bomb attack targeted a security convoy in Pakistan’s volatile <u>Khyber Pakhtunkhwa</u> province on Saturday,28/06/2025, leaving 16 people dead, including 13 security personnel, and injuring several others.<br><br>According to officials, a vehicle packed with explosives rammed into a convoy near a military checkpoint in North Waziristan, a region long troubled by militancy and cross-border insurgency. The blast caused a powerful shockwave, setting multiple vehicles ablaze and damaging nearby structures.<br><br>Shortly after the incident, Pakistani authorities pointed fingers at India, suggesting foreign involvement behind the attack. As of now, no militant group has claimed responsibility, and investigations are ongoing. Still, Islamabad’s accusations follow a repetitive narrative — blaming India without offering verifiable evidence.<br><br>India has consistently denied such claims in the past and maintains that Pakistan must address the terror infrastructure operating within its borders rather than resorting to baseless allegations.<br><br><u><strong>Key Facts:</strong></u><br><u>Casualties</u>: 16 dead (13 security personnel, 3 civilians), several injured<br><br><u>Location:</u> Near a checkpoint in North Waziristan, Khyber Pakhtunkhwa<br><br><u>Method:</u> Suicide car bombing targeting a military convoy<br><br><u>Pakistan’s claim:</u> India involved — no proof presented<br><br><u>India’s stance: </u>Yet to respond, but has previously called such claims \"unfounded and diversionary\"<br><br>The incident highlights Pakistan’s deteriorating internal security, especially in its tribal border regions, and raises renewed concerns over its ability to curb domestic extremism. As regional tensions persist, calls for a fact-based investigation grow louder — rather than turning complex internal issues into cross-border blame games.\n  </p>",
            "author": {
                "name": "Anurag Srivastav"
            },
            "tags": [
            ],
            "date_published": "2025-06-29T11:17:51+05:30",
            "date_modified": "2025-06-29T11:17:51+05:30"
        },
        {
            "id": "https://microo-watch.netlify.app/india-rejects-court-of-arbitration-slams-charade-at-pakistans-behest.html",
            "url": "https://microo-watch.netlify.app/india-rejects-court-of-arbitration-slams-charade-at-pakistans-behest.html",
            "title": "India Rejects Court of Arbitration, Slams &#x27;Charade at Pakistan’s Behest&#x27;",
            "summary": "In a clear and assertive diplomatic move, India has refused to participate in proceedings of the so-called Court of Arbitration (CoA) initiated under the Indus Waters Treaty — calling it “illegal,” “politically motivated,” and nothing more than a “charade at Pakistan’s behest.” The Ministry of&hellip;",
            "content_html": "\n  <p>\n    In a clear and assertive diplomatic move, India has refused to participate in proceedings of the so-called Court of Arbitration (CoA) initiated under the Indus Waters Treaty — calling it “illegal,” “politically motivated,” and nothing more than a “charade at Pakistan’s behest.”<br><br>The <strong>Ministry of External Affairs (MEA)</strong> issued a strongly worded statement, accusing Pakistan of manipulating global legal platforms to push its anti-India narrative. India emphasized that the correct and treaty-compliant mechanism is the neutral expert process, not an arbitration court manufactured for political optics.<br><br>“This is not about water. This is about Pakistan’s obsession with dragging India into legal traps to gain geopolitical attention,” said a senior Indian diplomat.<br><br><strong><u>India’s Stand: Firm and Lawful</u></strong><br>The CoA was unilaterally constituted, violating treaty norms.<br><br>The Indus Waters Treaty lays out a step-by-step process, which Pakistan bypassed.<br><br>India warns the global community of allowing legal institutions to be hijacked by terror-exporting states.<br><br>New Delhi also reminded the world that Pakistan, with its long-standing support for cross-border terrorism, holds little moral ground to lecture others on treaties and international order.<br><br>India’s refusal to participate is being seen as a stand for sovereignty, legal integrity, and strategic clarity.\n  </p>\n\n  <p>\n    <br><u><strong>Pakistan’s Predictable Playbook</strong></u><br>Pakistan once again turned to international forums after failing to win on bilateral or diplomatic grounds. Its objections to India’s hydroelectric projects — like Kishanganga and Ratle — are part of a larger, decades-old pattern of stalling Indian development projects under the guise of treaty concerns.\n  </p>\n\n  <p>\n    <br>But this time, India isn't playing along.<br>\n  </p>\n\n  <p>\n    <strong>What This Means for the Region</strong><br>By rejecting participation, India has drawn a red line — signalling it will not allow global institutions to be used as tools for legal warfare. The message is clear: New Delhi is done entertaining selective outrage and stage-managed legal setups that favor Islamabad’s agenda.<br><br>For many in the region, this is not just a water dispute — it’s a battle for narrative, credibility, and influence.<br><br>\n  </p>",
            "author": {
                "name": "Anurag Srivastav"
            },
            "tags": [
            ],
            "date_published": "2025-06-28T20:14:21+05:30",
            "date_modified": "2025-06-28T20:14:21+05:30"
        }
    ]
}
